[
    [
        "Sanity Check",
        "Welcome Pilot! Prove your identity.",
        0,
        true,
        "3njoy_th3_g4m3_c4d3t",
        true,
        500,
        ["Check #announcements in Discord"],
        0,
        true,
        [],
        "noone"
    ],
    [
        "Alien? Human? Symbol?!",
        "Upon regaining consciousness, Alex and his crew immediately embarked on a quest to secure their rescue. During their exploration, they stumbled upon a weird, ancient engraving. Their primary mission: deciphering the enigmatic SYMBOLS, in the pursuit of uncovering the mysteries of this alien world.",
        1,
        false,
        "S1MPUL_SYMB0L_C1PH3R_Y4YYYY",
        true,
        100,
        [],
        0,
        true,
        ["/files/inscription.txt"],
        "4darsh"
    ],
    [
        "HEXagonal Basement",
        "The crew move on to the communications base, at the basement of which lies its control centre. There lay a lot of abandoned devices, but most of them didn’t stand the test of time. However, they found an old BASE’ic blackbox, which keeps generating what appears to be encoded gibberish texts. But are they really that useless?",
        2,
        false,
        "5up3r_53cur3_3nc0d1ng",
        false,
        100,
        [],
        0,
        true,
        ["/files/encoded.txt"],
        "n0tsane"
    ],
    [
        "Meta - verse",
        "After getting the creds of the system, Alex and crew begin investigating its contents. They stumble upon an image 'starmap'. Drawing from his experience, Alex suspects that it might conceal additional data.",
        3,
        true,
        "c1v1l1s4t10ns_ch4ng3_5t4rm4p_d03snt",
        true,
        100,
        [],
        0,
        true,
        ["/files/starmap.jpg"],
        "itzmelucifer"
    ],
    [
        "._..__._..._ recording",
        "The investigation continues, and now they come across an audio file. However, dcoding an audio created by the ancient MORtals poses a perplexing challenge.",
        4,
        false,
        "TH3R3ISST1LLHOP3",
        true,
        100,
        [],
        0,
        true,
        ["/files/audio.wav"],
        "Mystic"
    ],
    [
        "3 Hopeful Inspections",
        "On further INSPECTion, the team finds a classified document named 'HOPE Articulation', which explains what HOPE is. However, the document seems incomplete. Is there more information here?<br><a href='https://trailblaze.space:16003'>https://trailblaze.space:16003</a>",
        5,
        false,
        "1sp3ct_y0ur_w4y_0ut",
        true,
        100,
        [],
        0,
        true,
        [],
        "itzmelucifer"
    ],
    [
        "White or Blank",
        "Turns out the Hyperstellar Operations and Planetary Exploration craft is situated somewhere on the planet. Just when they try to extract its details, the command centre loses its power. While they attempt to find their way out, Alex finds a ‘Security Manual’, but its all WHITE pages. The crew must decipher this secretive manual.",
        6,
        true,
        "4ll_th4ts_bl4nk_15nt_3mpty",
        true,
        200,
        [],
        0,
        true,
        ["/files/readme.txt"],
        "DragonBeast"
    ],
    [
        "Check for sum MDs",
        "Commander Mercer and crew finally get out of the communications base. To get to H.O.P.E., they require a password to override the controls of the Hoverboard. The SecUrity Manual contained a link, but its as blank as the manual itself.  Does it really contain something?<br><a href='https://trailblaze.space:16001/'>https://trailblaze.space:16001/</a>",
        7,
        false,
        "pa55w0rd_0v3rwr1te_s3quenc3_5ucc3sful",
        false,
        200,
        [],
        0,
        true,
        [],
        "e4stw1nd"
    ],
    [
        "Reverse the JS panel",
        "The crew has finally reached the H.O.P.E. Its entrance reads \"You must authenticate yourself to use this emergency craft!\". Enclose the obtained flag in blaze{}.<br><a href='https://trailblaze.space:16002/'>https://trailblaze.space:16002/</a>",
        8,
        false,
        "cl13n7_s1d3_4u7h_r34lly_sucks",
        true,
        200,
        [],
        0,
        true,
        [],
        "itzmelucifer"
    ],
    [
        "Look for the WORDs",
        "Alex and his team have finally entered the spacecraft. To, use the it, they must read the instruction manuals kept inside. Unfortunately, for security reasons, parts of the DOCX have been redacted. They must CONTROL over ALL the hidden information to activate H.O.P.E.",
        9,
        true,
        "lum1n1t3_f0st3rs_h0p3",
        true,
        200,
        [],
        0,
        true,
        ["/files/manual.pdf"],
        "Pr0meth3u5"
    ],
    [
        "Your Way Out",
        "The manuals unveiled the presence of Luminite, a unique fuel utilized within the spacecraft. The physical switch to activate the ignition systems, however, is located in a hidden location within the spacecraft. An XOR tool (present therein) reveals the location if its output has all bits (10 bits) set to 1. The crew must find the location.<br><a href='https://trailblaze.space:16004/'>https://trailblaze.space:16004/</a>",
        10,
        false,
        "4di3u_tr14ngulum",
        false,
        200,
        [],
        0,
        true,
        [],
        "cyb3rpunk_b4ddi3"
    ],
    [
        "Overflow",
        "While cruising through the vast expanse of space, your ship is suddenly hit by a football sized asteroid. Although the collision did not harm the engine, the debris clogged the coolant's drainage system, which caused an overflow of the coolant into the sensors room. Alex must repair the damage before the sensors fail.<br><a href='https://trailblaze.space:16000/'>https://trailblaze.space:16000/</a>",
        11,
        false,
        "0verflow_s0lved",
        false,
        300,
        [],
        0,
        true,
        ["/files/repairMe.c"],
        "e4stw1nd"
    ],
    [
        "Precise Navigation",
        "The spaceship must now be maneuvered in the direction of the Milky Way. The coordinates are given in this strange site. Find them out.<br><a href='https://trailblaze.space:16005/'>https://trailblaze.space:16005/</a>",
        12,
        true,
        "m1lky_w4y_1s_0ut_7h3r3",
        true,
        300,
        [],
        0,
        true,
        [],
        "Devadamdar*69"
    ],
    [
        "Spectrogram",
        "The crew is now in the Milky Way. The receiver of the Hope detected some weird signal, but the ship's SONIC ANALYZER faultered and failed to DCODE it. Help Alex in interpreting the signal.",
        13,
        false,
        "533_7hr0u9h_4ud10",
        true,
        300,
        [],
        0,
        true,
        ["/files/signal.wav"],
        "DragonBeast"
    ],
    [
        "VIA GALACTICA",
        "While Alex is in his own galaxy, the spacecraft has fallen short of luminite, so he gets to the nearest fuel station installed by the Gaia Dominion. However, he has to authenticate himself using some method which their founder, Gaius Julius Caesar, invented. Help him decipher this code to get the fuel.",
        14,
        false,
        "c43s4r_w4s_sm4rt_5ub5t1tut10n_1s_n0t",
        false,
        300,
        [],
        0,
        true,
        ["files/auth.py"],
        "n0tsane"
    ],
    [
        "QR: 660, Binary: 660",
        "Alex gets his hands on a file named 660*660.txt He says its a simple binary file, but I say its an image!!! Find out urself",
        15,
        true,
        "b1n4r13s_c0uld_b3_0f_gr34t_us3",
        false,
        300,
        [],
        0,
        true,
        ["/files/660*660.txt"],
        "itzmelucifer"
    ],
    [
        "Basic cookies",
        "Traveling across the galaxy has left our commander feeling hungry, and he has requested that you bring him some COOKIES. However, upon reaching the vending machine, you discover that only Commander Alex has access to it. Can you still manage to retrieve the snack?<br><a href='https://trailblaze.space:16006/'>https://trailblaze.space:16006/</a>",
        16,
        false,
        "level_16",
        false,
        500,
        [],
        0,
        true,
        [],
        "anonymous"
    ],
    [
        "NOX for seeds",
        "According to the star map, Alex is on the final leg of his voyage.\nAfter spending such a long time in space he is very eager to reach home, he\nwants to find a token of remembrance for his wife, whom he misses dearly.\nHe decides to get a SEED of his wife's favourite flowers. In front of him lies a challenge. Forsythia is only found on planet NOX, known for its brutal and xenophobic species.\n\nHelp Alex get that SEED!",
        17,
        false,
        "r37r13v31ng_7he_fl0w3r_w4s_r34lly_d4ng3r0us_s71ll_w1f3y_w1ll_b3_h4ppy",
        false,
        500,
        [],
        0,
        true,
        ["/files/seed.py"],
        "s4yCh33se!"
    ],
    [
        "jwt",
        "level_18 - jwt <br><a href='https://trailblaze.space:16007/'>https://trailblaze.space:16007/</a>",
        18,
        true,
        "level_18",
        false,
        500,
        [],
        0,
        true,
        [],
        "anonymous"
    ],
    [
        "bluff",
        "level_19 - bluff websites <br><a href='https://trailblaze.space:16008/'>https://trailblaze.space:16008/</a>",
        19,
        false,
        "level_19",
        false,
        500,
        [],
        0,
        true,
        [],
        "anonymous"
    ],
    [
        "earth",
        "level_20 - huge image reconstruct",
        20,
        true,
        "level_20",
        false,
        500,
        [],
        0,
        true,
        [],
        "anonymous"
    ]
]