[
    [
        "Sanity Check",
        "Welcome Pilot! Prove your identity.",
        0,
        true,
        "",
        true,
        500,
        ["Check #announcements in Discord"],
        0,
        true,
        [],
        ""
    ],
    [
        "NOX for seeds",
        "According to the star map, Alex is on the final leg of his voyage.\nAfter spending such a long time in space he is very eager to reach home, he\nwants to find a token of remembrance for his wife, whom he misses dearly.\nHe decides to get a SEED of his wife's favourite flowers. In front of him lies a challenge. Forsythia is only found on planet NOX, known for its brutal and xenophobic species.\n\nHelp Alex get that SEED!",
        17,
        false,
        "r37r13v31ng_7he_fl0w3r_w4s_r34lly_d4ng3r0us_s71ll_w1f3y_w1ll_b3_h4ppy",
        false,
        500,
        [],
        0,
        true,
        ["/files/seed.py"],
        "s4yCh33se!"
    ],
    [
        "QR: 660, Binary: 660",
        "Alex gets his hands on a file named 660*660.txt He says its a simple binary file, but I say its an image!!! Find out urself",
        15,
        true,
        "b1n4r13s_c0uld_b3_0f_gr34t_us3",
        false,
        300,
        [],
        0,
        true,
        ["/files/660*660.txt"],
        "itzmelucifer"
    ],
    [
        "",
        "While cruising through the vast expanse of space, your ship is suddenly hit by a football sized asteroid. Although the collision did not harm the engine, the debris clogged the coolant's drainage system, which caused an overflow of the coolant into the sensors room. Alex must repair the damage before the sensors fail.",
        11,
        false,
        "0verflow_s0lved",
        false,
        300,
        [],
        0,
        true,
        ["/files/repairMe.c"],
        "e4stw1nd"
    ],
    [
        "",
        "The crew is now in the Milky Way. The receiver of the Hope detected some weird signal, but the ship's SONIC ANALYZER faultered and failed to DCODE it. Help Alex in interpreting the signal.",
        12,
        true,
        "533_7hr0u9h_4ud10",
        true,
        300,
        [],
        0,
        true,
        ["/files/signal.wav"],
        "DragonBeast"
    ]
]