[
    [
        "Sanity Check",
        "Welcome Pilot! Prove your identity.",
        0,
        true,
        "",
        true,
        500,
        ["Check #announcements in Discord"],
        0,
        true,
        [],
        ""
    ],
    [
        "NOX for seeds",
        "According to the star map, Alex is on the final leg of his voyage.\nAfter spending such a long time in space he is very eager to reach home, he\nwants to find a token of remembrance for his wife, whom he misses dearly.\nHe decides to get a SEED of his wife's favourite flowers. In front of him lies a challenge. Forsythia is only found on planet NOX, known for its brutal and xenophobic species.\n\nHelp Alex get that SEED!",
        17,
        false,
        "r37r13v31ng_7he_fl0w3r_w4s_r34lly_d4ng3r0us_s71ll_w1f3y_w1ll_b3_h4ppy",
        false,
        500,
        [],
        0,
        true,
        ["/files/seed.py"],
        "s4yCh33se!"
    ],
    [
        "QR: 660, Binary: 660",
        "Alex gets his hands on a file named 660*660.txt He says its a simple binary file, but I say its an image!!! Find out urself",
        15,
        true,
        "b1n4r13s_c0uld_b3_0f_gr34t_us3",
        false,
        300,
        [],
        0,
        true,
        ["/files/660*660.txt"],
        "itzmelucifer"
    ],
    [
        "Overflow",
        "While cruising through the vast expanse of space, your ship is suddenly hit by a football sized asteroid. Although the collision did not harm the engine, the debris clogged the coolant's drainage system, which caused an overflow of the coolant into the sensors room. Alex must repair the damage before the sensors fail.",
        11,
        false,
        "0verflow_s0lved",
        false,
        300,
        [],
        0,
        true,
        ["/files/repairMe.c"],
        "e4stw1nd"
    ],
    [
        "Spectrogram",
        "The crew is now in the Milky Way. The receiver of the Hope detected some weird signal, but the ship's SONIC ANALYZER faultered and failed to DCODE it. Help Alex in interpreting the signal.",
        12,
        true,
        "533_7hr0u9h_4ud10",
        true,
        300,
        [],
        0,
        true,
        ["/files/signal.wav"],
        "DragonBeast"
    ],
    [
        "HEXagonal Basement",
        "The crew move on to the communications base, at the basement of which lies it's control centre. There lay a lot of abandoned devices, but most of them didn’t stand the test of time. However, they found an old BASE’ic blackbox, which keeps generating what appears to be encoded gibberish texts. But are they really that useless?",
        2,
        false,
        "5up3r_53cur3_3nc0d1ng",
        false,
        100,
        [],
        0,
        true,
        ["/files/encoded.txt"],
        "n0tsane"
    ],
    [
        "Meta - verse",
        "After getting the creds of the system, Alex and crew begin investigating its contents. They stumble upon an image 'starmap'. Drawing from his experience, Alex suspects that it might conceal additional data.",
        3,
        true,
        "c1v1l1s4t10ns_ch4ng3_5t4rm4p_d03snt",
        true,
        100,
        [],
        0,
        true,
        ["/files/starmap.jpg"],
        "itzmelucifer"
    ],
    [
        "._..__._..._ recording",
        "The investigation continues, and now they come across an audio file. However, dcoding an audio created by the ancient MORtals poses a perplexing challenge.",
        4,
        false,
        "TH3R3ISST1LLHOP3",
        true,
        100,
        [],
        0,
        true,
        ["/files/audio.wav"],
        "Mystic"
    ],
    [
        "Alien? Human? Symbol?!",
        "Upon regaining consciousness, Alex and his crew immediately embarked on a quest to secure their rescue. During their exploration, they stumbled upon a weird, ancient engraving. Their primary mission: deciphering the enigmatic SYMBOLS, in the pursuit of uncovering the mysteries of this alien world.\n\n   Enclose the obtained flag in blaze{}",
        1,
        false,
        "S1MPUL_SYMB0L_C1PH3R_Y4YYYY",
        true,
        100,
        [],
        0,
        true,
        ["/files/inscription.txt"],
        "4darsh"
    ]
]